;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el
(when (package! screenshot :recipe (:local-repo "~/.doom.d/lisp/screenshot"))
  (package! posframe))
(package! org-appear :recipe (:local-repo "~/.doom.d/lisp/org-appear"))
(package! org-pretty-table :recipe (:local-repo "~/.doom.d/lisp/org-pretty-table"))
(package! org-super-agenda)
(package! sublimity)
(package! solaire-mode)
(package! selectric-mode)
(package! rainbow-mode)
(package! org-superstar)
(package! org-roam)
(package! org-msg)
(package! org-mime)
(package! nyan-mode)
(package! neotree)
(package! mpdmacs)
(package! lua-mode)
(package! highlight-indent-guides)
(package! gif-screencast)
(package! elcord)
(package! dracula-theme)
(package! consult-dir)
(package! company-emojify)
(package! aggressive-indent)
(package! 0x0)
(package! centaur-tabs :pin "b4249c40581368faf7bb8e06f86b9eee199c3c6")
