;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el
(when (package! screenshot :recipe (:local-repo "~/.doom.d/lisp/screenshot"))
  (package! posframe))
(package! org-appear :recipe (:local-repo "~/.doom.d/lisp/org-appear"))
(package! org-pretty-table :recipe (:local-repo "~/.doom.d/lisp/org-pretty-table"))
(package! org-super-agenda)
(package! sublimity)
(package! solaire-mode)
(package! selectric-mode)
(package! rainbow-mode)
(package! org-superstar)
(package! org-roam)
(package! org-msg)
(package! org-mime)
(package! nyan-mode)
(package! neotree)
(package! mpdmacs)
(package! lua-mode)
(package! highlight-indent-guides)
(package! gif-screencast)
(package! elcord)
(package! dracula-theme)
(package! consult-dir)
(package! company-emojify)
(package! aggressive-indent)
(package! 0x0)
;; (package! centaur-tabs :pin "b4249c40581368faf7bb8e06f86b9eee199c3c6" :disable t)
(package! vlf :recipe (:host github :repo "m00natic/vlfi" :files ("*.el"))
  :pin "cc02f2533782d6b9b628cec7e2dcf25b2d05a27c")
(package! dashboard :disable t)
(package! org-pretty-tags :pin "5c7521651b35ae9a7d3add4a66ae8cc176ae1c76")
(package! marginalia)
(package! theme-magic)
(package! poetry :pin "5b9ef569d629d79820e73b5380e54e443ba90616")
(package! org-recent-headings)
(package! auto-complete)
(package! mw-thesaurus)
(package! beacon)
(package! clippy)
(package! org-sidebar)
(package! chronos)
(package! column-enforce-mode)
(package! centered-cursor-mode)
(package! transwin)
(package! smudge)
(package! bufler)
(package! rainbow-delimiters)
(package! olivetti)
(package! freeze-it)
(package! cyberpunk-theme)
(package! zoom-window)
(package! goggles)
(package! hammy :recipe (:host github :repo "alphapapa/hammy.el"))
